In [1]:
import pandas as pd
import numpy as np

In [2]:
#initialising Dataframe
df = pd.DataFrame({'City':['Hyderabad','Mumbai','Chandigarh','Kolkata'],'State':['Telangana','Maharastra','Punjab','West Bengal']})
df

         City        State
0   Hyderabad    Telangana
1      Mumbai   Maharastra
2  Chandigarh       Punjab
3     Kolkata  West Bengal

In [3]:
print(df['City'])
print(type(df['City']))#this is a series
#each column in df is Series

0     Hyderabad
1        Mumbai
2    Chandigarh
3       Kolkata
Name: City, dtype: object
<class 'pandas.core.series.Series'>

In [4]:
#initiazing Series
sr = pd.Series([0,1,2,3,4,5],name = "Numbers")
sr

0    0
1    1
2    2
3    3
4    4
5    5
Name: Numbers, dtype: int64

In [5]:
#maximum in series
sr.max()

#minimum in series
sr.min()

0

In [6]:
df2 = pd.Series(np.random.random(5),index = ['a','b','c','d','e'])
df2

a    0.700905
b    0.390738
c    0.832562
d    0.690758
e    0.716480
dtype: float64

In [7]:
df1 = pd.DataFrame({'Marks':[99,44,55,77,96]})
print(df1.max())
print(df1.min())
#print(type(df1['Marks'].max()))

Marks    99
dtype: int64
Marks    44
dtype: int64

In [8]:
#to get some basic statistics of numerical data
df1.describe()

           Marks
count   5.000000
mean   74.200000
std    24.386472
min    44.000000
25%    55.000000
50%    77.000000
75%    96.000000
max    99.000000

Reading data from external files(csv,txt)

In [9]:
t_data = pd.read_csv("data.txt",header = None)
t_data

                     0
0    This is text data
1  theres nothing here

In [10]:
csv_data = pd.read_csv("c_data.csv")
csv_data

   rollno    name
0       1    Abby
1       2  Lucien
2       3   Chris
3       4     Cat

In [11]:
#access only first few rows
print("First rows\n",csv_data.head(2))
#access only last few rows 
print("Last rows\n",csv_data.tail(3))

First rows
    rollno    name
0       1    Abby
1       2  Lucien
Last rows
    rollno    name
1       2  Lucien
2       3   Chris
3       4     Cat

In [12]:
#convert one file to other
exl_data = csv_data.to_excel("exl_data.xlsx",sheet_name ='Passengers',index=False)

In [13]:
e_data = pd.read_excel("exl_data.xlsx")
e_data

   rollno    name
0       1    Abby
1       2  Lucien
2       3   Chris
3       4     Cat

In [14]:
csv_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   rollno  4 non-null      int64
 1   name    4 non-null      object
dtypes: int64(1), object(1)
memory usage: 112.0+ bytes

In [70]:
#creating a new column in csv_data
csv_data["Marks"] = [99,78,44,50]
csv_data["Class"] = ["ECE","CSE","MECH","CSE"]
csv_data["Address"] = ["Earth",np.nan,"Moon","Mars"]
csv_data["Attendance"] = [66,78,98,35]
csv_data

   rollno    name  Marks Class Adress  Attendance Address
0       1    Abby     99   ECE  Earth          66   Earth
1       2  Lucien     78   CSE    NaN          78     NaN
2       3   Chris     44  MECH   Moon          98    Moon
3       4     Cat     50   CSE   Mars          35    Mars

In [40]:
#selecting a subset based on condition
csv_data[csv_data["Marks"]>50]

   rollno    name  Marks Class Adress
0       1    Abby     99   ECE  Earth
1       2  Lucien     78   CSE    NaN

In [19]:
#series of boolean values for a condition
csv_data["Marks"]>40

0    True
1    True
2    True
3    True
Name: Marks, dtype: bool

In [24]:
csv_data[csv_data["Class"].isin(["CSE"])]

   rollno    name  Marks Class
1       2  Lucien     78   CSE
3       4     Cat     50   CSE

In [20]:
#shape of a dataframe
csv_data.shape

(4, 3)

In [79]:
csv_data.drop(columns = ["Adress"])

   rollno    name  Marks Class  Attendance Address
0       1    Abby     99   ECE          66   Earth
1       2  Lucien     78   CSE          78     NaN
2       3   Chris     44  MECH          98    Moon
3       4     Cat     50   CSE          35    Mars

In [80]:
#getting only know persons data
csv_data[csv_data["Address"].notna()]

   rollno   name  Marks Class Adress  Attendance Address
0       1   Abby     99   ECE  Earth          66   Earth
2       3  Chris     44  MECH   Moon          98    Moon
3       4    Cat     50   CSE   Mars          35    Mars

In [54]:
#using loc for column names or row names
csv_data.loc[csv_data["Class"]=="CSE","name"]

1    Lucien
3       Cat
Name: name, dtype: object

In [44]:
#using iloc for column number or row number
print(csv_data.iloc[1:3,2:4])
print(csv_data.iloc[1,4])

   Marks Class
1     78   CSE
2     44  MECH
nan

In [45]:
#calculating statistics
csv_data["Marks"].mean()

67.75

In [46]:
csv_data["Marks"].median()

64.0

In [56]:
csv_data[["Marks","Attendance"]].mean()

Marks         67.75
Attendance    69.25
dtype: float64

In [72]:
#sorting values
print(csv_data.sort_values(by= "Attendance",ascending = False))
csv_data.sort_values(by= "Attendance")

   rollno    name  Marks Class Adress  Attendance Address
2       3   Chris     44  MECH   Moon          98    Moon
1       2  Lucien     78   CSE    NaN          78     NaN
0       1    Abby     99   ECE  Earth          66   Earth
3       4     Cat     50   CSE   Mars          35    Mars

   rollno    name  Marks Class Adress  Attendance Address
3       4     Cat     50   CSE   Mars          35    Mars
0       1    Abby     99   ECE  Earth          66   Earth
1       2  Lucien     78   CSE    NaN          78     NaN
2       3   Chris     44  MECH   Moon          98    Moon

In [86]:
#concatinating to tables
d = {"rollno":[5,6,7],"name":["Rhysand","Amy","Julie"],"Class":["CSE","EEE","ECE"],"Address":["Atlanta","Seattle","NY"],"Attendance":[0,0,0]}
data2 = pd.DataFrame(d)
new_data = pd.concat([csv_data,data2])
new_data = new_data.drop(columns = ["Adress"])
new_data

   rollno     name  Marks Class  Attendance  Address
0       1     Abby   99.0   ECE          66    Earth
1       2   Lucien   78.0   CSE          78      NaN
2       3    Chris   44.0  MECH          98     Moon
3       4      Cat   50.0   CSE          35     Mars
0       5  Rhysand    NaN   CSE           0  Atlanta
1       6      Amy    NaN   EEE           0  Seattle
2       7    Julie    NaN   ECE           0       NY